mtosi1.1-TestSuite/TestsDefinitions/ManagedElementMgr/examples/ManagedElementMgr_getAllManagedElementNames.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns="tmf854.v1" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="tmf854.v1 ../../../../xsd/common/Header.xsd tmf854.v1 ../../../../xsd/interfaces/ManagedElementMgr.xsd http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Header>
		<header tmf854Version="1.1">
			<activityName>getAllManagedElementNames</activityName>
			<msgName>getAllManagedElementNames</msgName>
			<msgType>REQUEST</msgType>
			<correlationId>0001</correlationId>
			<senderURI>/MTOSI/InventoryOS</senderURI>
			<destinationURI>/MTOSI/EMS01</destinationURI>
			<communicationPattern>MultipleBatchResponse</communicationPattern>
			<communicationStyle>MSG</communicationStyle>
			<requestedBatchSize>0</requestedBatchSize>
			<timestamp>20051004140305</timestamp>
		</header>
	</soap:Header>
	<soap:Body>
		<getAllManagedElementNames tmf854Version="1.1">
			<mdName>
				<mdNm>Networks/XdrEMS/Server1</mdNm>
			</mdName>
		</getAllManagedElementNames>
	</soap:Body>
</soap:Envelope>
